Autodesk.Revit.DB.AlphanumericRevisionSettings.SetSequence(System.Collections.Generic.IList`1{System.String})
Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType.
Remarks:
If there are more alphanumeric revisions than there are
strings in the sequence, subsequent alphanumeric revisions will
be assigned duplicated characters. For example, if the sequence
provided were ["X", "Y"], the first alphanumeric revision would
be shown as "X", the second as "Y", the third as "XX", then "YY",
"XXX", etc.
sequence:
The sequence. The sequence strings cannot contain commas.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input sequence contains invalid entries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor(System.Collections.Generic.IList`1{System.String},System.String,System.String)
Constructs an AlphanumericRevisionSettings object.
sequence:
The custom sequence to be used as numbers for revisions with the
Alphanumeric RevisionNumberType.
If there are more alphanumeric revisions than there are
strings in the sequence, subsequent alphanumeric revisions will
be assigned duplicated characters. For example, if the sequence
provided were ["X", "Y"], the first alphanumeric revision would
be shown as "X", the second as "Y", the third as "XX", then "YY",
"XXX", etc.
prefix:
The prefix string for each revision number in the sequence.
suffix:
The suffix string for each revision number in the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input sequence contains invalid entries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016